# Importing Libraries Set up Eviroment

In [34]:
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

## Loading Data into Pandas Dataframe

In [35]:
Customers= pd.read_csv("Data/CSV/Customers.csv", encoding="latin1", sep=";")
Location= pd.read_csv("Data/CSV/Location.csv", encoding="latin1", sep=";")
Orders= pd.read_csv("Data/CSV/Orders.csv", encoding="latin1", sep=";")
Products= pd.read_csv("Data/CSV/Products.csv", encoding="latin1", sep=";")

### Pushing Dataframes Into SQL Sales Database

In [36]:
conn = sqlite3.connect("Data/SQL_db/sales.db")

In [38]:
Customers.to_sql("customers", conn, if_exists="replace", index=False)
Location.to_sql("locations", conn, if_exists="replace", index=False)
Orders.to_sql("orders", conn, if_exists="replace", index=False)
Products.to_sql("products", conn, if_exists="replace", index=False)

1894

# Tables Exploring

## Customers Table

### Basic quries

#### Select

In [ ]:
# selecting All the data from customers Table
query="""
SELECT * 
FROM
customers
"""
df = pd.read_sql_query(query, conn)
df

#### limit

In [40]:
# selecting only 10 customers

query="""
select *
from customers
limit 10;
"""
df = pd.read_sql_query(query, conn)
df

  Customer ID         Customer Name
0    AA-10315            Alex Avila
1    AA-10375          Allen Armold
2    AA-10480          Andrew Allen
3    AA-10645         Anna Andreadi
4    AB-10015         Aaron Bergman
5    AB-10060       Adam Bellavance
6    AB-10105         Adrian Barton
7    AB-10150           Aimee Bixby
8    AB-10165           Alan Barnes
9    AB-10255  Alejandro Ballentine

#### order by

##### asc

In [51]:
# Query write
query='''
select *
from customers
order by [Customer Name]
asc'''
df=pd.read_sql_query(query,conn)
print(df)

    Customer ID       Customer Name
0      AB-10015       Aaron Bergman
1      AH-10030       Aaron Hawkins
2      AS-10045      Aaron Smayling
3      AB-10060     Adam Bellavance
4      AH-10075           Adam Hart
..          ...                 ...
788    XP-21865        Xylona Preis
789    YS-21880       Yana Sorensen
790    YC-21895      Yoseph Carroll
791    ZC-21910    Zuschuss Carroll
792    ZD-21925  Zuschuss Donatelli

[793 rows x 2 columns]

##### desc

In [52]:
# Query write
query='''
select *
from customers
order by [Customer Name]
desc'''
df=pd.read_sql_query(query,conn)
print(df)

    Customer ID       Customer Name
0      ZD-21925  Zuschuss Donatelli
1      ZC-21910    Zuschuss Carroll
2      YC-21895      Yoseph Carroll
3      YS-21880       Yana Sorensen
4      XP-21865        Xylona Preis
..          ...                 ...
788    AH-10075           Adam Hart
789    AB-10060     Adam Bellavance
790    AS-10045      Aaron Smayling
791    AH-10030       Aaron Hawkins
792    AB-10015       Aaron Bergman

[793 rows x 2 columns]

## Locations Table

In [42]:
# Query write
query='''
select * 
from locations
'''
df=pd.read_sql_query(query,conn)
print(df)

     Postal Code             City       State   Region Country/Region
0        76106.0       Fort Worth       Texas  Central  United States
1        53711.0          Madison   Wisconsin  Central  United States
2        68025.0          Fremont    Nebraska  Central  United States
3        77095.0          Houston       Texas  Central  United States
4        75080.0       Richardson       Texas  Central  United States
..           ...              ...         ...      ...            ...
627      83301.0       Twin Falls       Idaho     West  United States
628      92672.0     San Clemente  California     West  United States
629      94568.0           Dublin  California     West  United States
630      93405.0  San Luis Obispo  California     West  United States
631      95240.0             Lodi  California     West  United States

[632 rows x 5 columns]

## Orders Table

In [43]:
# Query write
query='''
select * 
from orders
'''
df=pd.read_sql_query(query,conn)
print(df)

      Row ID        Order ID  Order Date   Ship Date       Ship Mode  \
0          1  CA-2022-152156  08/11/2022  11/11/2022    Second Class
1          2  CA-2022-152156  08/11/2022  11/11/2022    Second Class
2          3  CA-2022-138688  12/06/2022  16/06/2022    Second Class
3          4  US-2021-108966  11/10/2021  18/10/2021  Standard Class
4          5  US-2021-108966  11/10/2021  18/10/2021  Standard Class
...      ...             ...         ...         ...             ...
9989    9990  CA-2020-110422  21/01/2020  23/01/2020    Second Class
9990    9991  CA-2023-121258  26/02/2023  03/03/2023  Standard Class
9991    9992  CA-2023-121258  26/02/2023  03/03/2023  Standard Class
9992    9993  CA-2023-121258  26/02/2023  03/03/2023  Standard Class
9993    9994  CA-2023-119914  04/05/2023  09/05/2023    Second Class

     Customer ID    Segment  Postal Code       Product ID     Sales  Quantity  \
0       CG-12520   Consumer        42420  FUR-BO-10001798    261,96         2
1       CG-12520   Consumer        42420  FUR-CH-10000454    731,94         3
2       DV-13045  Corporate        90036  OFF-LA-10000240     14,62         2
3       SO-20335   Consumer        33311  FUR-TA-10000577  957,5775         5
4       SO-20335   Consumer        33311  OFF-ST-10000760    22,368         2
...          ...        ...          ...              ...       ...       ...
9989    TB-21400   Consumer        33180  FUR-FU-10001889    25,248         3
9990    DB-13060   Consumer        92627  FUR-FU-10000747     91,96         2
9991    DB-13060   Consumer        92627  TEC-PH-10003645   258,576         2
9992    DB-13060   Consumer        92627  OFF-PA-10004041      29,6         4
9993    CC-12220   Consumer        92683  OFF-AP-10002684    243,16         2

     Discount    Profit
0           0   41,9136
1           0   219,582
2           0    6,8714
3        0,45  -383,031
4         0,2    2,5164
...       ...       ...
9989      0,2    4,1028
9990        0   15,6332
9991      0,2   19,3932
9992        0     13,32
9993        0    72,948

[9994 rows x 13 columns]

## Products Table

In [44]:
# Query write
query='''
select * 
from products
'''
df=pd.read_sql_query(query,conn)
print(df)

           Product ID    Category Sub-Category  \
0     FUR-BO-10000112   Furniture    Bookcases
1     FUR-BO-10000330   Furniture    Bookcases
2     FUR-BO-10000362   Furniture    Bookcases
3     FUR-BO-10000468   Furniture    Bookcases
4     FUR-BO-10000711   Furniture    Bookcases
...               ...         ...          ...
1889  TEC-PH-10004912  Technology       Phones
1890  TEC-PH-10004922  Technology       Phones
1891  TEC-PH-10004924  Technology       Phones
1892  TEC-PH-10004959  Technology       Phones
1893  TEC-PH-10004977  Technology       Phones

                                           Product Name
0      Bush Birmingham Collection Bookcase, Dark Cherry
1     Sauder Camden County Barrister Bookcase, Plank...
2                    Sauder Inglewood Library Bookcases
3               O'Sullivan 2-Shelf Heavy-Duty Bookcases
4                             Hon Metal Bookcases, Gray
...                                                 ...
1889                  Cisco SPA112 2 Port Phone Adapter
1890             RCA Visys Integrated PBX 8-Line Router
1891  SKILCRAFT Telephone Shoulder Rest, 2" x 6.5" x...
1892             Classic Ivory AntiqueTelephoneZL1810
1893                                        GE 30524EE4

[1894 rows x 4 columns]

# Reports Builing By Using Joins

In [ ]:
query="""SELECT c.[Customer Name],
sum(o.Quantity*O.Sales) as Total_Sales
from orders o
join customers c
on o.[Customer ID] = c.[Customer ID]
group by c.[Customer Name]
order by Total_Sales
desc
limit 10;
"""

df = pd.read_sql_query(query, conn)
df

     Customer Name  Total_Sales
0      Sean Miller       146726
1    Adrian Barton       143812
2     Tamara Chand        92582
3     Becky Martin        88132
4      Joseph Holt        80478
5     Ken Lonsdale        74843
6        Greg Tran        72957
7     Bill Shonely        71566
8    Maria Etezadi        71540
9  Patrick O'Brill        69243